---
kind: method
id: M:Autodesk.Revit.DB.GeomCombinationSet.Erase(Autodesk.Revit.DB.GeomCombination)
source: html/e0eb2bfa-731a-e0c8-2cc4-b0754c595602.htm
---
# Autodesk.Revit.DB.GeomCombinationSet.Erase Method

Removes a specified GeomCombination from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	GeomCombination item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.GeomCombination`) - The GeomCombination to be erased.

## Returns
The number of GeomCombinations that were erased from the set.